## Importing Data

In [1]:
import pandas as pd

In [2]:
main_df = pd.read_csv("train.csv")
final_df = pd.read_csv("test.csv")

In [3]:
main_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [4]:
main_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
main_df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [6]:
final_df.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

## Preparing Data

In [7]:
def preprocess(df):
    df = df.drop(["PassengerId","Name","Ticket","Cabin"], axis=1)
    df = df.fillna(0)

    for n,item in enumerate(df["Sex"]):
        if item == "male":
            df.at[n,"Sex"] = 0 #According documentation, use dt.at[row, 'collumn'] instead df['column'][row]
        elif item == "female":
            df.at[n,"Sex"] = 1
        else:
            df.at[n,"Sex"] = 2 #Just in case
            
    for n,item in enumerate(df["Embarked"]):
        if item == "C":
            df.at[n,"Embarked"] = 0
        elif item == "Q":
            df.at[n,"Embarked"] = 1
        elif item == "S":
            df.at[n,"Embarked"] = 2 
        else:
            df.at[n,"Embarked"] = 3 #Just in case
            
    return df

## Train/Test Split

In [8]:
train_df = preprocess(main_df)
train_df_feat = train_df.iloc[:,1:]
train_df_class = train_df.iloc[:,0]
train_df_feat.head(10)

   Pclass Sex   Age  SibSp  Parch     Fare Embarked
0       3   0  22.0      1      0   7.2500        2
1       1   1  38.0      1      0  71.2833        0
2       3   1  26.0      0      0   7.9250        2
3       1   1  35.0      1      0  53.1000        2
4       3   0  35.0      0      0   8.0500        2
5       3   0   0.0      0      0   8.4583        1
6       1   0  54.0      0      0  51.8625        2
7       3   0   2.0      3      1  21.0750        2
8       3   1  27.0      0      2  11.1333        2
9       2   1  14.0      1      0  30.0708        0

In [9]:
train_df_feat.head(10)

   Pclass Sex   Age  SibSp  Parch     Fare Embarked
0       3   0  22.0      1      0   7.2500        2
1       1   1  38.0      1      0  71.2833        0
2       3   1  26.0      0      0   7.9250        2
3       1   1  35.0      1      0  53.1000        2
4       3   0  35.0      0      0   8.0500        2
5       3   0   0.0      0      0   8.4583        1
6       1   0  54.0      0      0  51.8625        2
7       3   0   2.0      3      1  21.0750        2
8       3   1  27.0      0      2  11.1333        2
9       2   1  14.0      1      0  30.0708        0

In [10]:
train_df_class.head(10)

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [11]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(train_df_feat, train_df_class, test_size=0.3, random_state=101)
X_train.head(10)

     Pclass Sex   Age  SibSp  Parch      Fare Embarked
520       1   1  30.0      0      0   93.5000        2
510       3   0  29.0      0      0    7.7500        1
446       2   1  13.0      0      1   19.5000        2
2         3   1  26.0      0      0    7.9250        2
691       3   1   4.0      0      1   13.4167        0
195       1   1  58.0      0      0  146.5208        0
790       3   0   0.0      0      0    7.7500        1
257       1   1  30.0      0      0   86.5000        2
39        3   1  14.0      1      0   11.2417        0
234       2   0  24.0      0      0   10.5000        2

In [12]:
y_train.head(10)

520    1
510    1
446    1
2      1
691    1
195    1
790    0
257    1
39     1
234    0
Name: Survived, dtype: int64

## Scaling Data

In [13]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
scaled_X_train = scaler.fit_transform(X_train)
scaled_X_test = scaler.transform(X_test)
scaled_X_train[:10]

C:\Users\ldf\Anaconda3\lib\site-packages\sklearn\preprocessing\data.py:334: DataConversionWarning: Data with input dtype int64, float64, object were all converted to float64 by MinMaxScaler.
  return self.partial_fit(X, y)

array([[0.        , 1.        , 0.40540541, 0.        , 0.        ,
        0.18249985, 0.66666667],
       [1.        , 0.        , 0.39189189, 0.        , 0.        ,
        0.01512699, 0.33333333],
       [0.5       , 1.        , 0.17567568, 0.        , 0.16666667,
        0.03806147, 0.66666667],
       [1.        , 1.        , 0.35135135, 0.        , 0.        ,
        0.01546857, 0.66666667],
       [1.        , 1.        , 0.05405405, 0.        , 0.16666667,
        0.02618765, 0.        ],
       [0.        , 1.        , 0.78378378, 0.        , 0.        ,
        0.28598956, 0.        ],
       [1.        , 0.        , 0.        , 0.        , 0.        ,
        0.01512699, 0.33333333],
       [0.        , 1.        , 0.40540541, 0.        , 0.        ,
        0.16883676, 0.66666667],
       [1.        , 1.        , 0.18918919, 0.125     , 0.        ,
        0.02194234, 0.        ],
       [0.5       , 0.        , 0.32432432, 0.        , 0.        ,
        0.02049464, 0.66666667]])

## Building Random Forest

In [14]:
from sklearn.ensemble import RandomForestClassifier

random_forest = RandomForestClassifier(n_estimators=100, random_state=0)
random_forest.fit(scaled_X_train, y_train)

random_forest.score(scaled_X_train, y_train)

0.9839486356340289

In [15]:
prediction = random_forest.predict(scaled_X_test)
prediction[:10]

array([0, 1, 0, 0, 0, 0, 0, 0, 1, 1], dtype=int64)

In [16]:
random_forest.score(scaled_X_test, y_test)

0.7835820895522388

## Just checking the Score

In [17]:
prediction = pd.DataFrame(prediction, index=y_test.index, columns=['Predicted'])
new_df = pd.concat([y_test,prediction],axis=1)
new_df.head(10)

     Survived  Predicted
331         0          0
700         1          1
748         0          0
751         1          0
481         0          0
845         0          0
740         1          0
287         0          0
669         1          1
241         1          1

In [18]:
new_df['RESULT'] = 0

for n in new_df.index:
    new_df['RESULT'][n] = 1-abs(new_df['Survived'][n] - new_df['Predicted'][n])

new_df.head(10)

     Survived  Predicted  RESULT
331         0          0       1
700         1          1       1
748         0          0       1
751         1          0       0
481         0          0       1
845         0          0       1
740         1          0       0
287         0          0       1
669         1          1       1
241         1          1       1

In [19]:
total = len(new_df)
right = 0

for n in new_df.index:
    if new_df['RESULT'][n]:
        right += 1

average = right/total
average

0.7835820895522388